app/views/finances/_finances_grid.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
SELECT "teams".* FROM "teams"
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", "8"]]
SELECT "finances".* FROM "finances" WHERE (user_id = 3)
---
    f.column name: 'Name', attribute: 'fullname', html: {style: 'text-align: center'}, model: 'User' do |fin|
      User.find(fin.user_id).fullname
    end
    f.column name: 'Team', attribute: 'team', html: {style: 'text-align: center'}, model: 'User' do |fin|
      Team.find(fin.user.team).name
    end
    f.column name: 'Date', attribute: 'date', html: {style: 'text-align: center'}, model: 'Finance', filter: false do |fin|