app/views/devise/registrations/edit.html.erb

        <%= f.label :school %>
        <%= f.collection_select(:school, School.all, :id, :name) %><br><br>
        <%= f.label :team %>
        <%= f.collection_select(:team, Team.all, :id, :name) %><br><br>
---
SELECT "schools".* FROM "schools"
SELECT "teams".* FROM "teams"