app/views/users/editusers.html.erb

SELECT "users".* FROM "users"
---

    u.column name: 'Name', attribute: 'fullname', html: {style: 'text-align: center'}, model: 'User' do |fin|

SELECT "teams".* FROM "teams"
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "schools".* FROM "schools"
SELECT "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT 1  [["id", "2"]]
---
    end
    u.column name: 'Team', attribute: 'team', html: {style: 'text-align: center'}, model: 'User' do |fin|
      Team.find(fin.team).name
    end
    u.column name: 'School', attribute: 'school', html: {style: 'text-align: center'}, model: 'User' do |fin|
      School.find(fin.school).name