app/views/users/edit.html.erb

SELECT "schools".* FROM "schools"
SELECT "teams".* FROM "teams"
---
        <%= f.label :school %>
        <%= f.collection_select(:school, School.all, :id, :name) %><br><br>
        <%= f.label :team %>
        <%= f.collection_select(:team, Team.all, :id, :name) %><br><br>