app/views/pages/teamtotals.html.erb

    </tr>
	<% Team.all.each do |team| %>
	<tr>
	  <td><strong><%= Team.find(team.id).name %></strong></td>
---
SELECT "teams".* FROM "teams"
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", 1]]