app/views/pages/teammanagement.html.erb

SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", "8"]]
---
<div class = "container">
  <h1><%= Team.find(current_user.team).name %>'s Totals Table</h1><br>