app/controllers/finances_controller.rb

  def index

    if user_signed_in?
      if current_admin_user
        @finance = Finance.new
#         Get all user names
        @user = User.new
		@team_filter = Array.new
		Team.all.each do |team|
---
SELECT "teams".* FROM "teams"

          :order => 'finances.id',
          :order_direction => 'desc',
          :conditions => "user_id = #{current_user.id}" )
        @total_cash = current_user.finances.sum("cash_amount")
        @total_check = current_user.finances.sum("check_amount")
---
SELECT "finances".* FROM "finances"
SELECT COUNT(DISTINCT "finances"."id") FROM "finances" LEFT OUTER JOIN "users" ON "users"."id" = "finances"."user_id" WHERE (( teams.name LIKE '%Cambodi%'))
SELECT SUM("finances"."check_amount") AS sum_id FROM "finances" WHERE "finances"."user_id" = 2

  def create
    if current_admin_user
      #@finance = Finance.new(params[:finance])

      @finance = User.find(:all, :conditions => ["fullname = ?", params[:user][:fullname]]).first.finances.new(params[:finance])
      respond_to do |format|
        if @finance.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
INSERT INTO "finances" ("audit", "cash_amount", "check_amount", "check_number", "created_at", "data_entry", "date", "notes", "supporter_name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    if current_admin_user
      @finance = Finance.find(params[:id])
      @finance.destroy
---
SELECT "finances".* FROM "finances" WHERE "finances"."id" = ? LIMIT 1  [["id", "5"]]
DELETE FROM "finances" WHERE "finances"."id" = ?  [["id", 5]]