app/controllers/pages_controller.rb

  def teamtotals
  	 if user_signed_in?
      if current_admin_user
        @finances_grid = initialize_grid(Finance,
          :include => [:user])
        @total_cash = Finance.sum("cash_amount")
        @total_check = Finance.sum("check_amount")
        @total_amount = @total_cash + @total_check

		@team_total_cash = Array.new(Team.all.size + 1, 0);
		@team_total_check = Array.new(Team.all.size + 1, 0);
		@team_total_amount = Array.new(Team.all.size + 1, 0);


        User.all.each do |user|
		  #add all the funds of teams who aren't admins and aren't leaders
          if !user.leader
			@team_total_cash[user.team.to_i - 1] += user.finances.sum("cash_amount")
			@team_total_check[user.team.to_i - 1] += user.finances.sum("check_amount")
---
SELECT SUM("finances"."cash_amount") AS sum_id FROM "finances"
SELECT SUM("finances"."check_amount") AS sum_id FROM "finances"
SELECT "teams".* FROM "teams"
SELECT "users".* FROM "users"
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", 1]]
SELECT SUM("finances"."cash_amount") AS sum_id FROM "finances" WHERE "finances"."user_id" = 1
SELECT SUM("finances"."check_amount") AS sum_id FROM "finances" WHERE "finances"."user_id" = 1

  def teammanagement
	if user_signed_in?
      if current_user.leader?
	    @users = User.where(:team => current_user.team)
		@total_amount = 0
		@member_total_amount = Array.new(@users.size, 0)

		@counter = 0
		@users.each do |u|
		  @member_total_amount[@counter] = u.finances.sum("cash_amount") + u.finances.sum("check_amount")
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", "8"]]
SELECT "users".* FROM "users" WHERE "users"."team" = 8 ORDER BY id
SELECT COUNT(*) FROM "users" WHERE "users"."team" = 8
SELECT SUM("finances"."check_amount") AS sum_id FROM "finances" WHERE "finances"."user_id" = 2

  def leaderlookup
	if user_signed_in?
	  if current_user.leader?
	    @user = User.find(params[:id])
		if current_user.team != @user.team
		  redirect_to root_path, notice: "Not authorized"
		else
		  @finances_grid = initialize_grid(Finance,
            :include => [:user],
            :order => 'finances.id',
            :order_direction => 'desc',
            :conditions => "user_id = #{@user.id}" )
          @total_cash = @user.finances.sum("cash_amount")
          @total_check = @user.finances.sum("check_amount")
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
SELECT "finances".* FROM "finances" WHERE (user_id = 3)
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", "2"]]
SELECT COUNT(DISTINCT "finances"."id") FROM "finances" LEFT OUTER JOIN "users" ON "users"."id" = "finances"."user_id" WHERE ((user_id = 3) AND ( users.team = '2'))
SELECT SUM("finances"."check_amount") AS sum_id FROM "finances" WHERE "finances"."user_id" = 3