app/controllers/pages_controller.rb

  def teammanagement
	if user_signed_in?
      if current_user.leader
	    @users = User.where(:team => Team.find(current_user.team)).order("id")
		@total_amount = 0
		@member_total_amount = Array.new(@users.size, 0)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1