app/controllers/teams_controller.rb

  def create
    @team = Team.new(params[:team])
    respond_to do |format|
      if @team.save
---
INSERT INTO "teams" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 29 Apr 2015 07:52:47 UTC +00:00], ["name", "Cambodia"], ["updated_at", Wed, 29 Apr 2015 07:52:47 UTC +00:00]]