app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])
    if params[:user][:password].blank?
	  params[:user].delete(:password)
	  params[:user].delete(:password_confirmation)
	end
    if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "users" SET "email" = 'testing3@gmail.com', "admin" = 'f', "leader" = 'f', "updated_at" = '2015-05-06 02:21:19.259605' WHERE "users"."id" = 7

  def destroy
    if current_admin_user
      @user = User.find(params[:id])
	  @user.finances.destroy_all
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "finances" WHERE "finances"."id" = ?  [["id", 6]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]

  def editusers
	@team_filter = Array.new
	Team.all.each do |team|
		@team_filter.push [team.name, team.id]
	end

	@school_filter = Array.new
	School.all.each do |school|
---
SELECT "teams".* FROM "teams"
SELECT "schools".* FROM "schools"